src/res/wrk2profile2.txt
Running 1m test @ http://localhost:8080
  4 threads and 250 connections
  Thread calibration: mean lat.: 1.720ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.711ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.705ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.56ms    1.30ms  30.62ms   93.18%
    Req/Sec    10.53k     1.65k   20.11k    77.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.31ms
 75.000%    1.85ms
 90.000%    2.44ms
 99.000%    7.41ms
 99.900%   13.80ms
 99.990%   22.24ms
 99.999%   28.35ms
100.000%   30.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.061     0.000000            3         1.00
       0.596     0.100000       199629         1.11
       0.791     0.200000       398638         1.25
       0.963     0.300000       597033         1.43
       1.135     0.400000       796045         1.67
       1.314     0.500000       994156         2.00
       1.408     0.550000      1093841         2.22
       1.506     0.600000      1193395         2.50
       1.609     0.650000      1292454         2.86
       1.722     0.700000      1392068         3.33
       1.847     0.750000      1491014         4.00
       1.917     0.775000      1540558         4.44
       1.995     0.800000      1590247         5.00
       2.081     0.825000      1639873         5.71
       2.177     0.850000      1689472         6.67
       2.293     0.875000      1739763         8.00
       2.361     0.887500      1764548         8.89
       2.441     0.900000      1789013        10.00
       2.541     0.912500      1813756        11.43
       2.671     0.925000      1838718        13.33
       2.865     0.937500      1863460        16.00
       3.013     0.943750      1875875        17.78
       3.203     0.950000      1888245        20.00
       3.461     0.956250      1900647        22.86
       3.843     0.962500      1913071        26.67
       4.339     0.968750      1925519        32.00
       4.619     0.971875      1931686        35.56
       4.931     0.975000      1937887        40.00
       5.287     0.978125      1944104        45.71
       5.699     0.981250      1950316        53.33
       6.191     0.984375      1956532        64.00
       6.475     0.985938      1959627        71.11
       6.803     0.987500      1962746        80.00
       7.167     0.989062      1965861        91.43
       7.583     0.990625      1968962       106.67
       8.079     0.992188      1972060       128.00
       8.375     0.992969      1973605       142.22
       8.695     0.993750      1975158       160.00
       9.071     0.994531      1976725       182.86
       9.511     0.995313      1978257       213.33
      10.055     0.996094      1979814       256.00
      10.375     0.996484      1980589       284.44
      10.727     0.996875      1981363       320.00
      11.079     0.997266      1982152       365.71
      11.479     0.997656      1982921       426.67
      11.983     0.998047      1983698       512.00
      12.263     0.998242      1984082       568.89
      12.559     0.998437      1984469       640.00
      12.943     0.998633      1984859       731.43
      13.335     0.998828      1985246       853.33
      13.871     0.999023      1985633      1024.00
      14.215     0.999121      1985826      1137.78
      14.591     0.999219      1986019      1280.00
      14.943     0.999316      1986216      1462.86
      15.431     0.999414      1986407      1706.67
      15.999     0.999512      1986603      2048.00
      16.375     0.999561      1986700      2275.56
      16.735     0.999609      1986798      2560.00
      17.135     0.999658      1986894      2925.71
      17.567     0.999707      1986989      3413.33
      18.255     0.999756      1987086      4096.00
      18.751     0.999780      1987136      4551.11
      19.455     0.999805      1987183      5120.00
      20.031     0.999829      1987233      5851.43
      20.703     0.999854      1987280      6826.67
      21.503     0.999878      1987330      8192.00
      21.855     0.999890      1987354      9102.22
      22.335     0.999902      1987378     10240.00
      23.039     0.999915      1987402     11702.86
      23.951     0.999927      1987426     13653.33
      24.703     0.999939      1987450     16384.00
      25.151     0.999945      1987462     18204.44
      25.439     0.999951      1987474     20480.00
      25.807     0.999957      1987488     23405.71
      26.271     0.999963      1987499     27306.67
      26.543     0.999969      1987511     32768.00
      26.783     0.999973      1987518     36408.89
      27.023     0.999976      1987523     40960.00
      27.135     0.999979      1987530     46811.43
      27.455     0.999982      1987535     54613.33
      27.871     0.999985      1987541     65536.00
      28.079     0.999986      1987544     72817.78
      28.143     0.999988      1987547     81920.00
      28.335     0.999989      1987550     93622.86
      28.575     0.999991      1987553    109226.67
      28.911     0.999992      1987556    131072.00
      28.975     0.999993      1987558    145635.56
      28.991     0.999994      1987559    163840.00
      29.151     0.999995      1987561    187245.71
      29.215     0.999995      1987562    218453.33
      29.343     0.999996      1987564    262144.00
      29.359     0.999997      1987565    291271.11
      29.359     0.999997      1987565    327680.00
      29.391     0.999997      1987567    374491.43
      29.391     0.999998      1987567    436906.67
      29.487     0.999998      1987568    524288.00
      29.487     0.999998      1987568    582542.22
      29.487     0.999998      1987568    655360.00
      29.599     0.999999      1987569    748982.86
      29.599     0.999999      1987569    873813.33
      29.711     0.999999      1987570   1048576.00
      29.711     0.999999      1987570   1165084.44
      29.711     0.999999      1987570   1310720.00
      29.711     0.999999      1987570   1497965.71
      29.711     0.999999      1987570   1747626.67
      30.639     1.000000      1987571   2097152.00
      30.639     1.000000      1987571          inf
#[Mean    =        1.562, StdDeviation   =        1.302]
#[Max     =       30.624, Total count    =      1987571]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2385472 requests in 1.00m, 188.83MB read
Requests/sec:  39757.49
Transfer/sec:      3.15MB